dbaeumer.vscode-eslint
esbenp.prettier-vscode
editorconfig.editorconfig
ms-python.python
ms-python.vscode-pylance
charliermarsh.ruff
ms-azuretools.vscode-docker
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-wsl
ms-vscode-remote.remote-containers
github.copilot
github.vscode-pull-request-github
eamodio.gitlens
usernamehw.errorlens
yzhang.markdown-all-in-one
streetsidesoftware.code-spell-checker
pkief.material-icon-theme
asvetliakov.vscode-neovim
tamasfe.even-better-toml
redhat.vscode-yaml
